Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/adc.c
/**
 * @file adc.c
 * @brief ADC Driver for RX72N S12ADFa - 12-bit Analog-to-Digital Conversion
 *
 * @details
 * ## Overview
 *
 * This file provides the hardware abstraction layer (HAL) for the S12ADFa
 * (12-bit Analog-to-Digital Converter) peripheral on the Renesas RX72N
 * microcontroller. The S12ADFa supports dual ADC units with 8 channels each,
 * configurable resolution (8/10/12-bit), and single-scan conversion mode.
 *
 * ## Hardware Architecture
 *
 * @dot
 * digraph adc_architecture {
 *   rankdir=LR;
 *   node [shape=box, style=rounded];
 *
 *   subgraph cluster_analog {
 *     label="Analog Inputs";
 *     style=dashed;
 *     an0 [label="AN0-AN7\n(S12AD0)"];
 *     an1 [label="AN16-AN23\n(S12AD1)"];
 *   }
 *
 *   subgraph cluster_adc {
 *     label="S12ADFa Peripheral";
 *     style=filled;
 *     fillcolor=lightblue;
 *     mux [label="Channel MUX"];
 *     sar [label="12-bit SAR\nConverter"];
 *     regs [label="ADDRn\nData Registers"];
 *   }
 *
 *   subgraph cluster_sw {
 *     label="Software (THIS FILE)";
 *     style=dashed;
 *     init [label="adc_init()"];
 *     read [label="adc_read()"];
 *     voltage [label="adc_read_voltage_mv()"];
 *   }
 *
 *   an0 -> mux;
 *   an1 -> mux;
 *   mux -> sar;
 *   sar -> regs;
 *   init -> regs [label="configure"];
 *   read -> regs [label="trigger & read"];
 *   voltage -> read [label="calls"];
 * }
 * @enddot
 *
 * ## S12ADFa Features Used
 *
 * | Feature | Status | Notes |
 * |---------|--------|-------|
 * | Dual ADC units (S12AD0, S12AD1) | [OK] | Both supported |
 * | 12/10/8-bit resolution | [OK] | Configurable per unit |
 * | Single-scan mode | [OK] | Software-triggered |
 * | Continuous scan mode | [X] | Not implemented |
 * | Group scan mode | [X] | Not implemented |
 * | A/D interrupts | [X] | Polling only |
 * | Self-diagnosis | [X] | Not implemented |
 * | Double trigger | [X] | Not implemented |
 *
 * ## Register Access Pattern
 *
 * @msc
 * Application, ADC_HAL, MSTPCRA, ADCSR, ADDRn;
 *
 * ... [label="Initialization"];
 * Application => ADC_HAL [label="adc_init(unit=0, ch=2, bits=12)"];
 * ADC_HAL => MSTPCRA [label="Clear bit 17 (enable S12AD0)"];
 * ADC_HAL => ADCSR [label="Configure resolution"];
 * ADC_HAL => Application [label="k_rx_ok"];
 *
 * ... [label="Conversion"];
 * Application => ADC_HAL [label="adc_read(unit=0, ch=2, &value)"];
 * ADC_HAL => ADCSR [label="Set ADST bit (start)"];
 * ADC_HAL box ADC_HAL [label="Poll ADST until clear"];
 * ADC_HAL => ADDRn [label="Read ADDR2"];
 * ADC_HAL => Application [label="k_rx_ok, value=raw"];
 * @endmsc
 *
 * ## Conversion Timing
 *
 * | Resolution | Conversion Time | Sample Rate (max) |
 * |------------|-----------------|-------------------|
 * | 12-bit | ~1.0 us | ~1 MHz |
 * | 10-bit | ~0.9 us | ~1.1 MHz |
 * | 8-bit | ~0.8 us | ~1.25 MHz |
 *
 * Note: Times are approximate at PCLKB = 60 MHz.
 *
 * ## Voltage Calculation
 *
 * The adc_read_voltage_mv() function converts raw ADC values to millivolts:
 *
 * @f[
 *   V_{mV} = \frac{V_{raw} \times V_{ref}}{2^{bits} - 1}
 * @f]
 *
 * Where:
 * - @f$ V_{raw} @f$ = Raw ADC value (0 to 2^bits-1)
 * - @f$ V_{ref} @f$ = Reference voltage (3300 mV)
 * - @f$ bits @f$ = Resolution (8, 10, or 12)
 *
 * ## Thread Safety
 *
 * | Function | Thread-Safe | Notes |
 * |----------|-------------|-------|
 * | adc_init() | No | Call during initialization only |
 * | adc_read() | No | Caller must synchronize |
 * | adc_read_voltage_mv() | No | Caller must synchronize |
 *
 * Each ADC unit can be accessed independently, but concurrent access to the
 * same unit requires external synchronization.
 *
 * ## Memory Usage
 *
 * | Section | Size | Contents |
 * |---------|------|----------|
 * | .text | ~800 bytes | Function code |
 * | .rodata | ~80 bytes | Log strings, tag |
 * | .bss | 6 bytes | s_adc_unit_initialized[2], s_adc_unit_resolution[2] |
 *
 * ## NASA Power of 10 Compliance
 *
 * | Rule | Status | Implementation |
 * |------|--------|----------------|
 * | 1. Simplify control flow | [OK] | No goto, setjmp, recursion |
 * | 2. Fixed loop bounds | [OK] | Timeout loop has fixed maximum |
 * | 3. No dynamic memory | [OK] | Static arrays only |
 * | 4. Functions < 60 lines | [OK] | Helper functions for decomposition |
 * | 5. Use assertions | [OK] | RX_CHECK_NULL_PTR, RX_CHECK_RANGE_TAG |
 * | 6. Data at smallest scope | [OK] | Local variables, static helpers |
 * | 7. Check return values | [OK] | RX_RETURN_ON_ERROR macro |
 * | 8. Limit preprocessor | [OK] | Only includes |
 * | 9. Restrict pointers | [OK] | Hardware register pointers only |
 * | 10. Compile warnings | [OK] | -Wall -Wextra -Werror clean |
 *
 * @see rx72n_adc_regs.h ADC register definitions
 * @see hardware.h ADC unit and channel types
 * @see rx_register_protection.h Module stop register access
 *
 * @author Locked, Inc.
 * @date 2026-01-01
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 * @since Version 1.0.0
 */

#ifdef __RX__

#include <string.h>

#include "hardware.h"
#include "rx72n_regs.h"
#include "rx_register_protection.h"

/* =============================================================================
 * Constants
 * =============================================================================
 */

/**
 * @enum adc_constants_t
 * @brief ADC hardware configuration limits
 *
 * @details
 * Defines the hardware limits and configuration constants for the S12ADFa
 * peripheral on the RX72N microcontroller. These values are derived from
 * the RX72N hardware manual Chapter 41 (S12ADFa).
 *
 * @see internal_get_adc_base() Uses k_adc_max_units for validation
 * @see s_adc_unit_initialized Array sized by k_adc_max_units
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_adc_max_units    = 2,   /**< Number of ADC units (S12AD0, S12AD1) */
  k_adc_max_channels = 8,   /**< Channels per unit (0-7 for S12AD0, 16-23 for S12AD1) */
  k_adc_timeout_ms   = 100, /**< Maximum wait time for conversion completion (ms) */
} adc_constants_t;

/**
 * @enum adc_bit_constants_t
 * @brief Bit manipulation constants for ADC register operations
 *
 * @details
 * Single-bit value used for shift operations when setting/clearing
 * individual bits in ADC control and channel selection registers.
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_adc_bit_one = 1U, /**< Single-bit value for shift operations (1 << n) */
} adc_bit_constants_t;

/**
 * @enum adc_module_stop_bits_t
 * @brief ADC module stop bit positions in MSTPCRA register
 *
 * @details
 * Defines the bit positions in the MSTPCRA (Module Stop Control Register A)
 * that control the clock supply to the S12AD0 and S12AD1 modules. These bits
 * must be cleared (clock enabled) before accessing ADC registers.
 *
 * ## Module Stop Control
 *
 * | Bit | Module | 0 = Clock Enabled | 1 = Clock Stopped |
 * |-----|--------|-------------------|-------------------|
 * | 17 | S12AD0 | ADC unit 0 active | ADC unit 0 stopped |
 * | 16 | S12AD1 | ADC unit 1 active | ADC unit 1 stopped |
 *
 * @note Accessing ADC registers while module clock is stopped causes bus error
 * @note PRCR register must be unlocked before modifying MSTPCRA
 *
 * @see internal_configure_adc_unit() Uses these to enable module clock
 * @see rx_register_protection.h PRCR unlock/lock functions
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_adc_mstpra_s12ad1 = 16, /**< MSTPCRA bit 16: S12AD1 module stop control */
  k_adc_mstpra_s12ad0 = 17, /**< MSTPCRA bit 17: S12AD0 module stop control */
} adc_module_stop_bits_t;

/**
 * @enum adc_adcer_bits_t
 * @brief ADC Control Extended Register (ADCER) bit definitions
 *
 * @details
 * Defines the bit fields for the ADCER (A/D Control Extended Register) which
 * controls ADC resolution and data format. The ADPRC field (bits 1:0) sets
 * the A/D conversion resolution.
 *
 * ## ADCER Register Layout (bits 1:0 - ADPRC)
 *
 * | ADPRC[2:1] | Resolution | Max Value | Conversion Time |
 * |------------|------------|-----------|-----------------|
 * | 00 | 12-bit | 4095 | ~1.0 us |
 * | 01 | 10-bit | 1023 | ~0.9 us |
 * | 10 | 8-bit | 255 | ~0.8 us |
 * | 11 | Reserved | - | - |
 *
 * @see internal_configure_adc_unit() Uses these to set resolution
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_adc_adcer_adprc_mask =
    3U, /**< ADPRC field mask (2-bit, unshifted) per RX72N HW manual R01UH0824EJ0111 Section 56.2.13 */
  k_adc_adcer_adprc_shift = 1U, /**< ADPRC field bit position: bits 2:1 of ADCER */
  k_adc_adcer_adprc_12bit = 0U, /**< ADPRC = 00: 12-bit resolution (default) */
  k_adc_adcer_adprc_10bit = 1U, /**< ADPRC = 01: 10-bit resolution */
  k_adc_adcer_adprc_8bit  = 2U, /**< ADPRC = 10: 8-bit resolution */
} adc_adcer_bits_t;

/**
 * @enum adc_adcsr_bits_t
 * @brief ADC Control/Status Register (ADCSR) bit definitions
 *
 * @details
 * Defines bit values for the ADCSR (A/D Control Status Register) which
 * controls conversion start and indicates conversion status.
 *
 * ## ADCSR Bit 15 (ADST) - A/D Conversion Start
 *
 * | Value | Read Meaning | Write Meaning |
 * |-------|--------------|---------------|
 * | 0 | Conversion stopped/complete | (No effect) |
 * | 1 | Conversion in progress | Start conversion |
 *
 * @see adc_read() Uses ADST to trigger and poll conversion
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_adc_adcsr_idle = 0U,     /**< Idle state: ADST=0 (conversion complete) */
  k_adc_adcsr_adst = 32768U, /**< Start bit: ADST=1 (bit 15 = 0x8000 = 32768) */
} adc_adcsr_bits_t;

/**
 * @enum adc_channel_boundaries_t
 * @brief ADC channel selection register boundaries
 *
 * @details
 * Defines the channel boundaries for ADANSA0 and ADANSA1 registers.
 * Channels 0-15 are selected via ADANSA0, channels 16+ via ADANSA1.
 *
 * For S12AD0: Physical channels AN0-AN7 (channels 0-7)
 * For S12AD1: Physical channels AN16-AN23 (channels 0-7 mapped)
 *
 * @see adc_init() Uses these for channel enable logic
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_adc_channel_adansa0_max  = 15, /**< Maximum channel for ADANSA0 register */
  k_adc_channel_adansa1_base = 16, /**< Base channel for ADANSA1 register */
} adc_channel_boundaries_t;

/* ADC channel indices (k_adc_channel_0 through k_adc_channel_7) defined in hardware.h */

/**
 * @enum adc_misc_constants_t
 * @brief ADC timeout and voltage reference constants
 *
 * @details
 * Miscellaneous constants for timeout handling and voltage calculations.
 *
 * ## Timeout Calculation
 *
 * Total timeout iterations = k_adc_timeout_ms * k_adc_timeout_multiplier
 *                          = 100 * 1000 = 100,000 iterations
 *
 * At ~10 cycles per iteration, this provides ~4ms timeout at 240 MHz.
 *
 * ## Voltage Reference
 *
 * The RX72N STAR board uses 3.3V as the ADC reference voltage (AVCC).
 * The k_adc_reference_voltage_mv constant (3300 mV) is used in the
 * voltage calculation formula.
 *
 * @see adc_read() Uses timeout constants
 * @see adc_read_voltage_mv() Uses reference voltage
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_adc_timeout_multiplier   = 1000, /**< Loop iterations per ms of timeout */
  k_adc_timeout_expired      = 0,    /**< Sentinel value: timeout counter reached zero */
  k_adc_reference_voltage_mv = 3300, /**< ADC reference voltage: 3.3V = 3300 mV */
} adc_misc_constants_t;

/**
 * @enum adc_raw_value_t
 * @brief Raw ADC value reset/default constants
 *
 * @details
 * Default raw value used to initialize the raw_value variable before a
 * conversion result is written. Using a named constant makes the intent
 * explicit and avoids magic numeric literals.
 *
 * @see adc_read_voltage_mv() Initializes raw_value with k_adc_raw_value_reset
 *
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_adc_raw_value_reset = 0, /**< Reset/default raw ADC value before conversion */
} adc_raw_value_t;

