Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/adc.c
/* =============================================================================
 * Static Variables
 * =============================================================================
 */

/**
 * @var s_tag
 * @brief Log tag for ADC module messages
 * @details Used with rx_log_* functions for consistent message tagging.
 */
static const char* const s_tag = "ADC";

/**
 * @var s_adc_unit_initialized
 * @brief Tracks initialization state for each ADC unit
 *
 * @details
 * Array indexed by ADC unit number (0 or 1). Set to true when adc_init()
 * successfully initializes the unit. Used to prevent double-initialization
 * and to validate that a unit is ready before reading.
 *
 * | Index | Unit | Default |
 * |-------|------|---------|
 * | 0 | S12AD0 | false |
 * | 1 | S12AD1 | false |
 *
 * @warning NOT thread-safe - initialization should be done from single thread
 *
 * @see adc_init() Sets to true on successful initialization
 * @see adc_read() Checks before allowing read operation
 */
static bool s_adc_unit_initialized[k_adc_max_units] = {false, false};

/**
 * @var s_adc_unit_resolution
 * @brief Stores configured resolution for each ADC unit
 *
 * @details
 * Array indexed by ADC unit number (0 or 1). Records the resolution
 * configured during first adc_init() call for each unit. Subsequent
 * init calls must use the same resolution (enforced at runtime).
 *
 * | Index | Unit | Default | Valid Values |
 * |-------|------|---------|--------------|
 * | 0 | S12AD0 | 12-bit | 8, 10, 12 |
 * | 1 | S12AD1 | 12-bit | 8, 10, 12 |
 *
 * @note Resolution is set only on first init and cannot be changed
 *
 * @see adc_init() Sets on first initialization, validates on subsequent
 * @see adc_read_voltage_mv() Uses for voltage calculation
 */
static adc_resolution_t s_adc_unit_resolution[k_adc_max_units] = {k_adc_resolution_12bit,
                                                                  k_adc_resolution_12bit};

/* =============================================================================
 * Internal Helper Functions
 * =============================================================================
 */

/**
 * @brief Get ADC register base address from unit number
 *
 * @details
 * Returns a pointer to the register structure for the specified ADC unit.
 * The RX72N has two ADC units with registers at different base addresses:
 *
 * | Unit | Peripheral | Base Address |
 * |------|------------|--------------|
 * | 0 | S12AD0 | 0x00089000 |
 * | 1 | S12AD1 | 0x00089100 |
 *
 *
 *
 * @pre None (pure lookup function)
 * @post No state changes
 *
 * @note Thread-safe: Pure function with no shared state
 * @note Performance: O(1), ~10 cycles
 *
 * @see s12ad0() Accessor for S12AD0 registers
 * @see s12ad1() Accessor for S12AD1 registers
 *
 * @since Version 1.0.0
 */
static volatile rx_s12ad_regs_t* internal_get_adc_base(const uint8_t unit)
{
  switch (unit) {
    case k_adc_unit_0: {
      return s12ad0();
    }
    case k_adc_unit_1: {
      return s12ad1();
    }
    default: {
      return nullptr;
    }
  }
}

/**
 * @brief Configure ADC unit control registers and enable module clock
 *
 * @details
 * Performs one-time initialization of an ADC unit:
 * 1. Unlocks PRCR to allow MSTPCRA modification
 * 2. Clears module stop bit in MSTPCRA (enables clock)
 * 3. Locks PRCR
 * 4. Configures ADCER register for desired resolution
 * 5. Marks unit as initialized
 *
 * ## Register Modification Sequence
 *
 * @code
 * PRCR = k_rx_prcr_unlock_prc1_prc3  // Enable MSTPCRA write
 * MSTPCRA &= ~(1 << module_stop_bit) // Clear module stop bit
 * PRCR = k_rx_prcr_lock              // Disable protected writes
 * ADCER = (ADCER & ~mask) | resolution_bits  // Set resolution
 * @endcode
 *
 *
 *
 * @pre adc must be valid pointer from internal_get_adc_base()
 * @pre Unit must not already be initialized
 *
 * @post Module clock enabled (MSTPCRA bit cleared)
 * @post ADCER configured with requested resolution
 * @post s_adc_unit_initialized[unit] = true
 *
 * @note NOT thread-safe: Protected register access
 * @note Performance: ~1 us @ 240 MHz
 * @note PRCR unlock window is minimized
 *
 * @warning Must not be called while ADC is converting
 * @warning PRCR access requires proper unlock sequence
 *
 * @see adc_init() Public API that calls this function
 * @see rx_register_protection.h PRCR constants
 *
 * @since Version 1.0.0
 */
static rx_err_t
internal_configure_adc_unit(const uint8_t unit, volatile rx_s12ad_regs_t* adc, const uint8_t bits)
{
  RX_CHECK_NULL_PTR(adc, s_tag, "ADC register pointer is nullptr");
  RX_CHECK_RANGE_TAG(unit, k_adc_unit_0, k_adc_unit_1, k_rx_err_invalid_arg, s_tag);

  if (bits != k_adc_resolution_8bit && bits != k_adc_resolution_10bit &&
      bits != k_adc_resolution_12bit) {
    rx_log_error(s_tag, "Invalid ADC resolution");
    return k_rx_err_invalid_arg;
  }

  *prcr_reg() = k_rx_prcr_unlock_prc1_prc3;

  if (unit == k_adc_unit_0) {
    system_regs()->mstpcra &= ~((uint32_t)k_adc_bit_one << k_adc_mstpra_s12ad0);
  } else {
    system_regs()->mstpcra &= ~((uint32_t)k_adc_bit_one << k_adc_mstpra_s12ad1);
  }

  *prcr_reg() = k_rx_prcr_lock;

  uint16_t adcer = adc->adcer;
  adcer &= (uint16_t) ~(uint16_t)(k_adc_adcer_adprc_mask << k_adc_adcer_adprc_shift);
  if (bits == k_adc_resolution_8bit) {
    adcer |= (uint16_t)(k_adc_adcer_adprc_8bit << k_adc_adcer_adprc_shift);
  } else if (bits == k_adc_resolution_10bit) {
    adcer |= (uint16_t)(k_adc_adcer_adprc_10bit << k_adc_adcer_adprc_shift);
  } else {
    adcer |= (uint16_t)(k_adc_adcer_adprc_12bit << k_adc_adcer_adprc_shift);
  }
  adc->adcer = adcer;

  s_adc_unit_initialized[unit] = true;
  rx_log_debug(s_tag, "ADC unit initialized");

  return k_rx_ok;
}

/**
 * @brief Validate ADC unit and channel numbers
 *
 * @details
 * Performs range validation for ADC unit and channel parameters before
 * any hardware access. This prevents undefined behavior from invalid
 * register access.
 *
 * ## Validation Rules
 *
 * | Parameter | Valid Range | Error Code |
 * |-----------|-------------|------------|
 * | unit | 0-1 (k_adc_unit_0 to k_adc_unit_1) | k_rx_err_invalid_arg |
 * | channel | 0-7 (k_adc_channel_0 to k_adc_channel_7) | k_rx_err_invalid_arg |
 *
 *
 *
 * @pre None (pure validation function)
 * @post No state changes
 *
 * @note Thread-safe: Pure function with no shared state
 * @note Performance: O(1), ~20 cycles
 * @note Logs error message on validation failure
 *
 * @see adc_init() Uses for parameter validation
 * @see adc_read() Uses for parameter validation
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_validate_unit_channel(const uint8_t unit, uint8_t channel)
{
  /* Validate unit */
  if (unit > k_adc_unit_1) {
    rx_log_error(s_tag, "Invalid ADC unit");
    return k_rx_err_invalid_arg;
  }

