Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/adc.c
  /* Validate channel */
  if (channel > k_adc_channel_7) {
    rx_log_error(s_tag, "Invalid ADC channel");
    return k_rx_err_invalid_arg;
  }

  return k_rx_ok;
}

/**
 * @brief Read raw ADC value from a specific channel data register
 *
 * @details
 * Helper function that reads the conversion result from the appropriate ADDRn
 * register based on channel number. Extracted from adc_read() to support
 * NASA Power of 10 Rule 4 (functions under 60 lines).
 *
 * ## Channel to Register Mapping
 *
 * | Channel | Register | Offset |
 * |---------|----------|--------|
 * | 0 | ADDR0 | 0x020 |
 * | 1 | ADDR1 | 0x022 |
 * | 2 | ADDR2 | 0x024 |
 * | 3 | ADDR3 | 0x026 |
 * | 4 | ADDR4 | 0x028 |
 * | 5 | ADDR5 | 0x02A |
 * | 6 | ADDR6 | 0x02C |
 * | 7 | ADDR7 | 0x02E |
 *
 *
 *
 * @pre adc must be valid pointer from internal_get_adc_base()
 * @pre ADC conversion must be complete (ADST bit cleared)
 *
 * @post *value contains raw ADC reading (12/10/8-bit depending on config)
 * @post No hardware state changes
 *
 * @note Thread-safe: Read-only register access
 * @note Performance: O(1), ~30 cycles
 *
 * @see adc_read() Calls this after conversion complete
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_read_channel_value(volatile rx_s12ad_regs_t* adc,
                                            const adc_channel_t       channel,
                                            uint16_t*                 value)
{
  RX_CHECK_NULL_PTR(adc, s_tag, "ADC register pointer is nullptr");
  RX_CHECK_NULL_PTR(value, s_tag, "value pointer is nullptr");

  switch (channel) {
    case k_adc_channel_0:
      *value = adc->addr0;
      break;
    case k_adc_channel_1:
      *value = adc->addr1;
      break;
    case k_adc_channel_2:
      *value = adc->addr2;
      break;
    case k_adc_channel_3:
      *value = adc->addr3;
      break;
    case k_adc_channel_4:
      *value = adc->addr4;
      break;
    case k_adc_channel_5:
      *value = adc->addr5;
      break;
    case k_adc_channel_6:
      *value = adc->addr6;
      break;
    case k_adc_channel_7:
      *value = adc->addr7;
      break;
    default:
      rx_log_error(s_tag, "Unsupported channel");
      return k_rx_err_invalid_arg;
  }

  return k_rx_ok;
}

/* =============================================================================
 * Public API Implementation
 * =============================================================================
 */

/**
 * @brief Initialize ADC unit and enable a specific channel
 *
 * @details
 * Configures the S12ADFa peripheral for A/D conversion. On first call for
 * each unit, enables the module clock, configures resolution, and initializes
 * the hardware. Subsequent calls to the same unit enable additional channels.
 *
 * ## Initialization Behavior
 *
 * | Scenario | Action | Resolution | Result |
 * |----------|--------|------------|--------|
 * | First init for unit | Full init | Set to 'bits' | k_rx_ok |
 * | Subsequent init, same bits | Enable channel only | Unchanged | k_rx_ok |
 * | Subsequent init, different bits | Error | Unchanged | k_rx_err_invalid_arg |
 *
 *
 *
 * @pre None (can be first call for unit)
 * @pre Resolution must match if unit already initialized
 *
 * @post Module clock enabled (if first init)
 * @post Channel enabled in ADANSA register
 * @post Unit marked as initialized
 *
 * @note NOT thread-safe: Call from initialization code only
 * @note Performance: ~1-2 us for first init, ~0.5 us for subsequent
 *
 * @par Example:
 * @code
 * // Initialize ADC unit 0, channel 2 with 12-bit resolution
 * rx_err_t err = adc_init(k_adc_unit_0, k_adc_channel_2, k_adc_resolution_12bit);
 * if (err != k_rx_ok) {
 *   rx_log_error("SENSOR", "ADC init failed: %d", err);
 *   return err;
 * }
 * @endcode
 *
 * @see adc_read() Read after initialization
 * @see adc_read_voltage_mv() Read as voltage
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] 2 preconditions, 3 postconditions
 */
rx_err_t adc_init(const adc_unit_t unit, const adc_channel_t channel, const adc_resolution_t bits)
{
  /* Validate parameters */
  rx_err_t err = internal_validate_unit_channel(unit, channel);
  RX_RETURN_ON_ERROR(err, s_tag, "Unit/channel validation failed");

  /* Validate resolution */
  if (bits != k_adc_resolution_8bit && bits != k_adc_resolution_10bit &&
      bits != k_adc_resolution_12bit) {
    rx_log_error(s_tag, "Invalid resolution (must be 8, 10, or 12 bits)");
    return k_rx_err_invalid_arg;
  }

  /* Get ADC base */
  volatile rx_s12ad_regs_t* const adc = internal_get_adc_base(unit);
  if (adc == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Initialize ADC unit if not already initialized */
  if (!s_adc_unit_initialized[unit]) {
    /* Store resolution for validation on subsequent calls */
    s_adc_unit_resolution[unit] = bits;

    err = internal_configure_adc_unit(unit, adc, bits);
    if (err != k_rx_ok) {
      return err;
    }
  } else {
    /* Unit already initialized - verify resolution matches */
    if (bits != s_adc_unit_resolution[unit]) {
      rx_log_error(s_tag, "ADC resolution mismatch on subsequent init");
      return k_rx_err_invalid_arg;
    }
  }

  /* Enable the specified channel */
  if ((uint8_t)channel <= k_adc_channel_adansa0_max) {
    adc->adansa0 |= ((uint16_t)k_adc_bit_one << channel);
  } else {
    adc->adansa1 |= ((uint16_t)k_adc_bit_one << ((uint8_t)channel - k_adc_channel_adansa1_base));
  }

  rx_log_debug(s_tag, "ADC channel enabled");

  return k_rx_ok;
}

/**
 * @brief Read raw ADC conversion value from specified channel
 *
 * @details
 * Performs a single-scan A/D conversion and returns the raw digital value.
 * This is a blocking operation that polls the ADST bit until conversion
 * completes or timeout occurs.
 *
 * ## Conversion Sequence
 *
 * 1. Validate parameters and initialization state
 * 2. Start conversion by setting ADCSR.ADST bit
 * 3. Poll ADCSR.ADST until cleared (conversion complete)
 * 4. Read result from appropriate ADDRn register
 *
 * ## Output Value Ranges
 *
 * | Resolution | Range | Full-Scale |
 * |------------|-------|------------|
 * | 12-bit | 0-4095 | 3.3V |
 * | 10-bit | 0-1023 | 3.3V |
 * | 8-bit | 0-255 | 3.3V |
 *
 *
 *
 * @pre ADC unit must be initialized via adc_init()
 * @pre value must point to valid uint16_t storage
 *
 * @post *value contains raw ADC reading (if k_rx_ok)
 * @post ADC ready for next conversion
 *
 * @note NOT thread-safe: Caller must synchronize if shared
 * @note Blocking: Waits up to ~100ms for conversion
 * @note Performance: ~1-10 us typical (depends on conversion time)
 *
 * @warning Do not call from ISR (blocking wait)
 *
 * @par Example:
 * @code
 * uint16_t raw_value;
 * rx_err_t err = adc_read(k_adc_unit_0, k_adc_channel_2, &raw_value);
 * if (err == k_rx_ok) {
 *   // Example: 12-bit resolution (0-4095 raw -> 0-3.3 V)
 *   static const float s_vref_volts = 3.3F;
 *   static const float s_adc_full_scale_12bit = 4095.0F;
 *   float voltage_v = (raw_value * s_vref_volts) / s_adc_full_scale_12bit;
 * }
 * @endcode
 *
 * @see adc_init() Must be called first
 * @see adc_read_voltage_mv() Convenience function for voltage
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 2: [OK] Timeout loop has fixed upper bound
 * - Rule 5: [OK] 2 preconditions, 2 postconditions
 */
rx_err_t adc_read(const adc_unit_t unit, const adc_channel_t channel, uint16_t* value)
{
  /* Validate parameters */
  RX_CHECK_NULL_PTR(value, s_tag, "Value pointer is nullptr");

  const rx_err_t err = internal_validate_unit_channel(unit, channel);
  RX_RETURN_ON_ERROR(err, s_tag, "Unit/channel validation failed");

