Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/adc.c
  /* Check if unit is initialized */
  if (!s_adc_unit_initialized[unit]) {
    rx_log_error(s_tag, "ADC unit not initialized");
    return k_rx_err_invalid_state;
  }

  /* Get ADC base */
  volatile rx_s12ad_regs_t* const adc = internal_get_adc_base(unit);
  if (adc == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Start single-scan conversion */
  adc->adcsr = k_adc_adcsr_adst;

  /* Wait for conversion to complete (poll ADCSR.ADST bit) */
  uint32_t timeout = k_adc_timeout_ms * k_adc_timeout_multiplier;
  while ((adc->adcsr & k_adc_adcsr_adst) != k_adc_adcsr_idle && timeout > k_adc_timeout_expired) {
    timeout--;
  }

  if (timeout == k_adc_timeout_expired) {
    rx_log_error(s_tag, "ADC conversion timeout");
    return k_rx_err_timeout;
  }

  /* Read conversion result from appropriate data register */
  return internal_read_channel_value(adc, channel, value);
}

/**
 * @brief Read ADC value and convert to millivolts
 *
 * @details
 * Performs an A/D conversion and scales the result to millivolts. This is
 * a convenience function that calls adc_read() and applies the voltage
 * calculation formula.
 *
 * ## Voltage Calculation Formula
 *
 * @f[
 *   V_{mV} = \frac{V_{raw} \times 3300}{2^{bits} - 1}
 * @f]
 *
 * ## Example Calculations
 *
 * | Resolution | Raw Value | Voltage (mV) | Calculation |
 * |------------|-----------|--------------|-------------|
 * | 12-bit | 2048 | 1650 | 2048 x 3300 / 4095 |
 * | 10-bit | 512 | 1650 | 512 x 3300 / 1023 |
 * | 8-bit | 128 | 1655 | 128 x 3300 / 255 |
 *
 *
 *
 * @pre ADC unit must be initialized via adc_init()
 * @pre bits must match the resolution used in adc_init()
 *
 * @post *voltage_mv contains voltage in millivolts (0-3300)
 * @post ADC ready for next conversion
 *
 * @note NOT thread-safe: Caller must synchronize if shared
 * @note Blocking: Waits for conversion (see adc_read)
 * @note Reference: Uses 3.3V reference (k_adc_reference_voltage_mv = 3300)
 *
 * @par Example:
 * @code
 * // Read motor current sense (DRV8263H IPROPI output)
 * uint32_t voltage_mv;
 * rx_err_t err = adc_read_voltage_mv(k_adc_unit_0, k_adc_channel_0,
 *                                     k_adc_resolution_12bit, &voltage_mv);
 * if (err == k_rx_ok) {
 *   // voltage_mv: 0-3300 mV
 *   // For DRV8263H-Q1 IPROPI (202 uA/A mirror, 5100 Ohm sense):
 *   // I_motor = V_IPROPI / k_ipropi_divisor
 *   // (where k_ipropi_divisor = 1.0302 = 202e-6 * 5100)
 *   // Fixed-point: scale = 10000, divisor = 10302 (1.0302 * 10000)
 *   enum : uint32_t { k_scale = 10000, k_divisor = 10302 };
 *   uint32_t current_ma = (voltage_mv * k_scale) / k_divisor;
 *   rx_log_info("ADC", "Current: %lu mA", current_ma);
 * }
 * @endcode
 *
 * @see adc_read() Lower-level raw value read
 * @see adc_init() Initialize before reading
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] 2 preconditions, 2 postconditions
 */
rx_err_t adc_read_voltage_mv(const adc_unit_t unit,
                             adc_channel_t    channel,
                             adc_resolution_t bits,
                             uint32_t*        voltage_mv)
{
  /* Parameter order: unit, channel, resolution bits. */
  RX_CHECK_NULL_PTR(voltage_mv, s_tag, "Voltage pointer is nullptr");

  if (bits != k_adc_resolution_8bit && bits != k_adc_resolution_10bit &&
      bits != k_adc_resolution_12bit) {
    rx_log_error(s_tag, "Invalid resolution (must be 8, 10, or 12 bits)");
    return k_rx_err_invalid_arg;
  }

  /* Validate that passed resolution matches unit's configured resolution */
  if (unit > k_adc_unit_1) {
    rx_log_error(s_tag, "Invalid ADC unit");
    return k_rx_err_invalid_arg;
  }

  if (bits != s_adc_unit_resolution[unit]) {
    rx_log_error(s_tag, "ADC resolution mismatch in voltage read");
    return k_rx_err_invalid_arg;
  }

  /* Read raw ADC value */
  uint16_t       raw_value = k_adc_raw_value_reset;
  const rx_err_t err       = adc_read(unit, channel, &raw_value);
  RX_RETURN_ON_ERROR(err, s_tag, "ADC read failed");

  /* Calculate voltage (using ADC reference voltage) */
  const uint32_t max_value = ((uint32_t)k_adc_bit_one << bits) - k_adc_bit_one;
  *voltage_mv              = ((uint32_t)raw_value * k_adc_reference_voltage_mv) / max_value;

  return k_rx_ok;
}

#endif /* __RX__ */
